{
    "title": "Mom’s Cinnamon Rolls",
    "categories": ["Breads"],
    "content": [
        {
            "markdown": [
                "Dissolve yeast in a  large mixing bowl and let proof for 10 minutes:",
                "",
                "(Use a stand mixer with a paddle attachment)"
            ]
        },
        {
            "ingredients": [
                {"amount": 0.5, "unit": "cup", "name": "water (110 degrees)"},
                {"amount": 2, "unit": "tbsp", "name": "dry active yeast"},
                {"amount": 2, "unit": "tsp", "name": "sugar"}
            ]
        },
        {
            "markdown": [
                "Add and mix in:"
            ]
        },
        {
            "ingredients": [
                {"amount": 0.5, "unit": "cup", "name": "butter"},
                {"amount": 0.5, "unit": "cup", "name": "sugar"},
                {"amount": 2, "unit": "count", "name": "eggs, beaten"},
                {"amount": 2, "unit": "tsp", "name": "salt"},
                {"amount": 1.5, "unit": "cup", "name": "lukewarm milk"},
                {"amount": 4, "unit": "cup", "name": "flour"}
            ]
        },
        {
            "markdown": [
                "When mixture forms a smooth “batter” mix in and continue to beat until a smooth dough forms:",
                "",
                "(Change beater attachment to a dough hook)"
            ]
        },
        {
            "ingredients": [
                {"amount": 3, "unit": "cup", "name": "flour"}
            ]
        },
        {
            "markdown": [
                "Turn dough out onto a floured surface and knead until completely smooth and elastic. Round the",
                "dough into a large greased bowl, cover and let rise in a warm place until dough has doubled.",
                "Punch the dough down and let rise a second time.",
                "",
                "## Sticky Pecan Topping",
                "",
                "In baking pan mix together into a thick paste in pan bottom:"
            ]
        },
        {
            "ingredients": [
                {"amount": 0.5, "unit": "cup", "name": "butter, softened"},
                {"amount": 1, "unit": "cup", "name": "brown sugar, packed"},
                {"amount": 2, "unit": "tbsp", "name": "dark corn syrup"}
            ]
        },
        {
            "markdown": [
                "Sprinkle with pecan halves:"
            ]
        },
        {
            "ingredients": [
                {"amount": 1.5, "unit": "cup", "name": "pecan halves"}
            ]
        },
        {
            "markdown": [
                "Form the rolls by punching down the dough and turning it out on a floured surface.",
                "Roll the dough into a large rectangle to fit your backing pan (e.g. 20 X 15” or 15 X 9”).",
                "",
                "Liberally grease the pan with soft butter for the large recipe and sprinkle with sugar and cinnamon:"
            ]
        },
        {
            "ingredients": [
                {"amount": 1, "unit": "cup", "name": "sugar"},
                {"amount": 1, "unit": "tsp", "name": "cinnamon"}
            ]
        },
        {
            "markdown": [
                "Smooth mixture with hands and roll the dough beginning with the long side into a log. Pinch the dough to seal.",
                "Cut the dough into rounds about 1 1/2” thick and place loosely in prepared pan, leaving room for the rolls to",
                "rise. At this point the pan may be covered and frozen until about 9 hours before baking, or allowed to rise",
                "until doubled and baked in a 375 degree oven for 25 to 30 minutes until rolls sound hollow when middle roll is",
                "thumped. Remove the pan from the oven, slide the blade of a knife around the outer edge, turn upside down on",
                "serving platter* (I have a large flat tray that I line with foil). Let rolls sit upside down for a minute or",
                "two and then carefully lift pan off, scraping any leftover topping onto the hot rolls. Best served hot."
            ]
        }
    ]
}
