{
    "title": "Pecan Squares",
    "categories": ["Cookies"],
    "content": [
        {
            "markdown": [
                "PECAN SQUARES",
                "",
                "Using a Cuisinart blend together until moist clumps form:",
                "",
                "2 C Flour",
                "",
                "1/2 C powdered sugar",
                "",
                "1 C chilled butter cut into 16 pieces",
                "",
                "Press the mixture into a 9 X 13\" baking pan lined with heavy foil, buttered.  (foil should extend",
                "up the sides and over the ends  as you will be lifting the cookies from the pan in a single sheet",
                "with the foil)",
                "",
                "Bake in a 350 degree oven for 20 minutes until golden brown.",
                "",
                "Mix together in a medium saucepan:",
                "",
                "2 C chopped pecans",
                "",
                "3/4 C packed light brown sugar",
                "",
                "3/4 C honey",
                "",
                "6 Tbsp heavy cream",
                "",
                "Bring to a boil over medium heat and cook for 2 minutes.  Pour mixture over the hot crust and return",
                "to the oven for 12 to 15 minutes until the filling bubbles and the cookie is caramel colored.  (do",
                "not remove too soon as the cookie topping will not set up, or too late because it can burn-keep an",
                "eye on the progress)  Lift the foil from the pan and cool the cookies for about 1/2 hour  to 45",
                "minutes.  Peel the foil away from the edges and let cool completely.  When completely cool,",
                "carefully use a spatula to slide the cookies from the foil to a cutting board.  Cut into 2\"",
                "squares* (cut each square in half diagonally to form triangles if desired) and store inbetween wax",
                "paper sheets in an airtight container.  These cookies will keep for two weeks stored this way, but",
                "they never last that long.",
                "",
                "*You may need to cut the crispy edges off."
            ]
        }
    ]
}
